#+TITLE: Emacs Configuration
#+AUTHOR: Rémi Dulong
#+COMMENT: Mostly inspired by Harry R. Schwartz, github.com/hrs/dotfiles
#+OPTIONS: toc:nil num:nil

* Configure =use-package=
  
  Set repositories :
  
  #+begin_src emacs-lisp
            (require 'package)
            (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                                     ("melpa" . "https://melpa.org/packages/")
                                     ("org" . "http://orgmode.org/elpa/")))  

  #+end_src

  #+RESULTS:
  : ((gnu . https://elpa.gnu.org/packages/) (melpa . https://melpa.org/packages/) (org . http://orgmode.org/elpa/))

I use =use-package= to install and configure my packages. My =init.el= includes the
  initial setup for =package.el= and ensures that =use-package= is installed, since I
  wanna do that right away.

  This makes sure that =use-package= will install the package if it's not already
  available. It also means that I should be able to open Emacs for the first time
  on a fresh Debian box and have my whole environment automatically installed. I'm
  not /totally/ sure about that, but we're gettin' close.

#+begin_src emacs-lisp
    (require 'use-package-ensure)
    (setq use-package-always-ensure t)
#+end_src

Always compile packages, and use the newest version available.

#+begin_src emacs-lisp
  (use-package auto-compile
    :config (auto-compile-on-load-mode))

  (setq load-prefer-newer t)
#+end_src

Disable TLS 1.3; ELPA has higher standards. That'll be the default in Emacs
26.3, I think, but I'm not there yet.

#+begin_src emacs-lisp
  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")
#+end_src

Disable deprecation warnings about =cl=. The =cl= library has been deprecated, but
lots of packages still use it. I can't control that, but I can disable the
warnings.

#+begin_src emacs-lisp
  (setq byte-compile-warnings '(cl-functions))
#+end_src

